In [2]:
import psycopg2
import pandas as pd
import psycopg2.extras

In [3]:
class PostgresConnection(object):
    def __init__(self):
        self.connection = psycopg2.connect(database ="postgres",
                                           user="postgres",
                                           password='',
                                           host="127.0.0.1",
                                           port="5432")
    def getConnection(self):
        print("succesfully connected to database")
        return self.connection

In [4]:
con = PostgresConnection().getConnection()

succesfully connected to database

# Q1

In [5]:
import pandas as pd
from sqlalchemy import create_engine

In [6]:
con = PostgresConnection().getConnection()
from IPython.display import display

# your code to generate the dataframe


query = '''
SELECT 
    s.division, s.district, 
    t.year, t.month, 
    SUM(f.total_price) AS total_sale_price 
FROM 
    ecomdb.Fact_table f 
    JOIN ecomdb.Time_dim t ON f.time_key = t.time_key 
    JOIN ecomdb.Item_dim i ON f.item_key = i.item_key 
    JOIN ecomdb.Customer_dim c ON f.customer_key = c.customer_key 
    JOIN ecomdb.store_dim s ON f.store_key = s.store_key 
GROUP BY 
    s.division, s.district, t.year, t.month 
ORDER BY 
    s.division, s.district, t.year, t.month;
'''

# Load the query results into a pandas dataframe
df = pd.read_sql_query(query, con)

# Close the database connection
con.close()

# Show the resulting dataframe
display(df)

succesfully connected to database

     division district  year  month  total_sale_price
0     BARISAL  BARGUNA  2014      1           3319.25
1     BARISAL  BARGUNA  2014      2          10521.25
2     BARISAL  BARGUNA  2014      3          10872.50
3     BARISAL  BARGUNA  2014      4          11095.25
4     BARISAL  BARGUNA  2014      5          10385.25
...       ...      ...   ...    ...               ...
5435   SYLHET   SYLHET  2020      9          21492.25
5436   SYLHET   SYLHET  2020     10          21373.25
5437   SYLHET   SYLHET  2020     11          17835.25
5438   SYLHET   SYLHET  2020     12          21289.00
5439   SYLHET   SYLHET  2021      1          12305.25

[5440 rows x 5 columns]

# Q2

In [7]:
con = PostgresConnection().getConnection()

query = '''
SELECT cd.name as customer_name, td2.bank_name, td2.trans_type, SUM(ft.total_price) as total_sale_price
FROM ecomdb.fact_table ft
JOIN ecomdb.time_dim td ON ft.time_key = td.time_key
JOIN ecomdb.item_dim id ON ft.item_key = id.item_key
JOIN ecomdb.customer_dim cd ON ft.customer_key = cd.customer_key
JOIN ecomdb.trans_dim td2 ON ft.payment_key = td2.payment_key
JOIN ecomdb.store_dim sd ON ft.store_key = sd.store_key
GROUP BY cd.name, td2.bank_name, td2.trans_type
ORDER BY cd.name, td2.bank_name, td2.trans_type
'''

# Load the query results into a pandas dataframe
df = pd.read_sql_query(query, con)

# Close the database connection
con.close()

# Show the resulting dataframe
display(df)

succesfully connected to database

,customer_name,bank_name,trans_type,total_sale_price
0,-,AB Bank Limited,card,329.00
1,-,Bangladesh Commerce Bank Limited,card,514.00
2,-,Bank Asia Limited,card,366.75
3,-,Bengal Commercial Bank Ltd,card,428.00
4,-,Bkash,mobile,786.00
...,...,...,...,...
168011,à¤¸à¤¾à¤¨à¤¿à¤¯à¤¾,Southeast Bank Limited,card,140.00
168012,à¤¸à¤¾à¤¨à¤¿à¤¯à¤¾,Standard Bank Limited,card,368.25
168013,à¤¸à¤¾à¤¨à¤¿à¤¯à¤¾,Trust Bank Limited,card,254.00
168014,à¤¸à¤¾à¤¨à¤¿à¤¯à¤¾,United Commercial Bank Ltd,card,231.00
168015,à¤¸à¤¾à¤¨à¤¿à¤¯à¤¾,Uttara Bank Limited,card,905.00

In [8]:
import ipykernel
ipykernel.get_connection_file()
# this will return something like: 'kernel-12345.json'

import os
os.environ['JUPYTER_RUNTIME_DIR'] = '/path/to/runtime/folder'

c.NotebookApp.iopub_data_rate_limit = 1.0e10

NameError: name 'c' is not defined

# Q3

In [9]:
con = PostgresConnection().getConnection()

query = '''
SELECT SUM(ft.total_price) AS total_sales
FROM ecomdb.Fact_table ft
JOIN ecomdb.Time_dim td ON ft.time_key = td.time_key
JOIN ecomdb.Item_dim itd ON ft.item_key = itd.item_key
JOIN ecomdb.Store_dim std ON ft.store_key = std.store_key
WHERE std.district = 'BARISAL' AND itd.item_name = 'Pepsi - 12 oz cans'

'''

# Load the query results into a pandas dataframe
df = pd.read_sql_query(query, con)

# Close the database connection
con.close()

# Show the resulting dataframe
display(df)

succesfully connected to database

   total_sales
0      12982.5

# Q4

In [10]:
con = PostgresConnection().getConnection()

query = '''
SELECT id.supplier, SUM(ft.total_price) as total_sale_price
FROM ecomdb.fact_table ft
JOIN ecomdb.time_dim td ON ft.time_key = td.time_key AND td.year = 2015
JOIN ecomdb.item_dim id ON ft.item_key = id.item_key
WHERE id.supplier = 'BIGSO AB'
GROUP BY id.supplier
ORDER BY id.supplier;

'''

# Load the query results into a pandas dataframe
df = pd.read_sql_query(query, con)

# Close the database connection
con.close()

# Show the resulting dataframe
display(df)

succesfully connected to database

   supplier  total_sale_price
0  BIGSO AB        1685691.75

# Q5

In [11]:
con = PostgresConnection().getConnection()

query = '''
SELECT sd.district, SUM(ft.total_price) as total_sale_price
FROM ecomdb.fact_table ft
JOIN ecomdb.time_dim td ON ft.time_key = td.time_key
JOIN ecomdb.item_dim id ON ft.item_key = id.item_key
JOIN ecomdb.customer_dim cd ON ft.customer_key = cd.customer_key
JOIN ecomdb.trans_dim td2 ON ft.payment_key = td2.payment_key
JOIN ecomdb.store_dim sd ON ft.store_key = sd.store_key
WHERE sd.district = 'DHAKA' AND td.year = 2015
GROUP BY sd.district

'''

# Load the query results into a pandas dataframe
df = pd.read_sql_query(query, con)

# Close the database connection
con.close()

# Show the resulting dataframe
display(df)

succesfully connected to database

  district  total_sale_price
0    DHAKA         3399121.5

# Q6

In [12]:
con = PostgresConnection().getConnection()

query = '''

            SELECT store_dim.store_key AS Store, 
                   item_dim.item_name AS Item, 
                   SUM(fact_table.quantity) AS Quantity_Sold
            FROM ecomdb.fact_table
            JOIN ecomdb.store_dim ON fact_table.store_key = store_dim.store_key
            JOIN ecomdb.item_dim ON fact_table.item_key = item_dim.item_key
            GROUP BY store_dim.store_key, item_dim.item_name
            ORDER BY store_dim.store_key, SUM(fact_table.quantity) DESC
            LIMIT 3;
           
'''

# Load the query results into a pandas dataframe
df = pd.read_sql_query(query, con)

# Close the database connection
con.close()

# Show the resulting dataframe
display(df)

succesfully connected to database

   store                                 item  quantity_sold
0  S0001                   Pepsi - 12 oz cans             92
1  S0001  Muscle Milk Protein Shake Van. 11oz             90
2  S0001     Hefty Supreme Foam Plates 6 inch             78

#Q7

In [15]:
class RecentItems:
    def __init__(self, db_connection, days):
        self.db_connection = db_connection
        self.days = days



con = PostgresConnection().getConnection()

query = '''

            SELECT DISTINCT ecomdb.item_dim.item_name
            FROM ecomdb.fact_table
            JOIN ecomdb.time_dim ON ecomdb.fact_table.time_key = ecomdb.time_dim.time_key
            JOIN ecomdb.trans_dim ON ecomdb.fact_table.payment_key = ecomdb.trans_dim.payment_key
            JOIN ecomdb.item_dim ON ecomdb.fact_table.item_key = ecomdb.item_dim.item_key
            WHERE (ecomdb.trans_dim.trans_type = 'card' OR ecomdb.trans_dim.trans_type = 'mobile')
                AND ecomdb.time_dim.date >= current_date - INTERVAL '{self.days} days'
           
'''

# Load the query results into a pandas dataframe
df = pd.read_sql_query(query, con)

# Close the database connection
con.close()

# Show the resulting dataframe
display(df)

succesfully connected to database

DatabaseError: Execution failed on sql '

            SELECT DISTINCT ecomdb.item_dim.item_name
            FROM ecomdb.fact_table
            JOIN ecomdb.time_dim ON ecomdb.fact_table.time_key = ecomdb.time_dim.time_key
            JOIN ecomdb.trans_dim ON ecomdb.fact_table.payment_key = ecomdb.trans_dim.payment_key
            JOIN ecomdb.item_dim ON ecomdb.fact_table.item_key = ecomdb.item_dim.item_key
            WHERE (ecomdb.trans_dim.trans_type = 'card' OR ecomdb.trans_dim.trans_type = 'mobile')
                AND ecomdb.time_dim.date >= current_date - INTERVAL '{self.days} days'

': invalid input syntax for type interval: "{self.days} days"
LINE 9: ...D ecomdb.time_dim.date >= current_date - INTERVAL '{self.day...
                                                             ^

In [ ]:
#Q8

In [ ]:
con = PostgresConnection().getConnection()

query = '''
SELECT ecom_schema.item_dim.item_name, ecom_schema.time_dim.quarter,
SUM(ecom_schema.fact_table.quantity) AS quantity_sales
FROM ecom_schema.fact_table
JOIN ecom_schema.item_dim ON ecom_schema.fact_table.item_key = ecom_schema.item_dim.item_key
JOIN ecom_schema.time_dim ON ecom_schema.fact_table.time_key = ecom_schema.time_dim.time_key
GROUP BY ROLLUP(ecom_schema.item_dim.item_name, ecom_schema.time_dim.quarter)
HAVING ecom_schema.item_dim.item_name IS NOT NULL AND ecom_schema.time_dim.quarter IS NOT NULL
ORDER BY ecom_schema.item_dim.item_name, SUM(ecom_schema.fact_table.quantity) ASC

'''

# Load the query results into a pandas dataframe
df = pd.read_sql_query(query, con)

# Close the database connection
con.close()

# Show the resulting dataframe
display(df)

#Q9

In [ ]:
 con = PostgresConnection().getConnection()

query = '''

            SELECT ecom_schema.item_dim.item_name, ecom_schema.time_dim.quarter,
                SUM(ecom_schema.fact_table.quantity) AS quantity_sales
            FROM ecom_schema.fact_table
            JOIN ecom_schema.item_dim ON ecom_schema.fact_table.item_key = ecom_schema.item_dim.item_key
            JOIN ecom_schema.time_dim ON ecom_schema.fact_table.time_key = ecom_schema.time_dim.time_key
            GROUP BY ROLLUP(ecom_schema.item_dim.item_name, ecom_schema.time_dim.quarter)
            HAVING ecom_schema.item_dim.item_name IS NOT NULL AND ecom_schema.time_dim.quarter IS NOT NULL
            ORDER BY ecom_schema.item_dim.item_name, SUM(ecom_schema.fact_table.quantity) ASC
           
           
'''

# Load the query results into a pandas dataframe
df = pd.read_sql_query(query, con)

# Close the database connection
con.close()

# Show the resulting dataframe
display(df)

#Q10

In [ ]:
 con = PostgresConnection().getConnection()

query = '''

            SELECT ecom_schema.item_dim.item_name, ecom_schema.store_dim.division, SUM(ecom_schema.fact_table.total_price) AS total_sales
            FROM ecom_schema.fact_table
            JOIN ecom_schema.item_dim ON ecom_schema.fact_table.item_key = ecom_schema.item_dim.item_key
            JOIN ecom_schema.store_dim ON ecom_schema.fact_table.store_key = ecom_schema.store_dim.store_key
            GROUP BY ROLLUP(ecom_schema.item_dim.item_name, ecom_schema.store_dim.division)
            HAVING ecom_schema.item_dim.item_name IS NOT NULL AND ecom_schema.store_dim.division IS NOT NULL
            ORDER BY ecom_schema.item_dim.item_name, SUM(ecom_schema.fact_table.total_price) DESC
           
'''

# Load the query results into a pandas dataframe
df = pd.read_sql_query(query, con)

# Close the database connection
con.close()

# Show the resulting dataframe
display(df)